window.addEventListener("load", () => {
  function getRandomInt(min, max) {
    min = Math.ceil(min);
    max = Math.floor(max);
    return Math.floor(Math.random() * (max - min) + min); // The maximum is exclusive and the minimum is inclusive
  }
  const chars = ["茭","茮","荞","荕","荩","荆","荊","莒","茘","荔","茢","荦","荬","茗","荓","茜","荨","荍","荛","荏","茙","茸","荣","茹","荗","荪","荑","莛","茼","荇","荥","荀","莚","药","茵","荫","荧","茟","茰","茽","荮","茱","茿","荘","茡","荢","荸","莂","荹","荼","茝","莗","莀","莐","莉","荲","莼","莝","莡","荻","莜","荳","荰","莌","莪","莑","荴","莆","莩","莄","莞","莟","荷","華","莧","获","莋","莢","莭","莖","莙","莰","莱","莨","莅","莲","莶","莽","莓","莔","莬","莈","莫","莯","莮","莥","莻","菦","莍","菃","荵","莎","莦","莘","莳","莤","荽","荾","莏","莵","莣","荱","莴","茣","莁","莃","莕","莠","荶","莹","莺","莸","荺","莇","莊","䓖","菴","菝","萆","菢","菩","菶","萙","萞","菔","菠","萡","菜","萗","菖","萇","菗","著","菙","萅","莿","菆","萃","萏","菪","菿","菂","菧","萣","菄","菲","萉","菒","菏","菮","菇","菰","菅","菓","萂","萀","萈","萑","萁","菺","菽","菨","菫","菳","菁","萛","菊","菹","菤","菌","菎","菈","萊","蓈","菞","菻","菱","菉","菕","萝","莾","菛","萌","萠","萘","菍","萢","萍","萋","萕","菬","菣","萨","萐","蒁","菥","菘","菭","菼","萄","菾","萔","萜","菟","萚","菀","萖","菵","菋","萎","萵","萧","菸","萒","萓","萟","萤","营","萦","萸","菑","菚","菷","菡","萻","葊","葆","葡","萹","葧","萴","蒇","蒢","葱","萶","蒫","蒂","葶","董","葮","萼","葑","萯","葍","葢","葛","蓇","葀","蒄","葒","葓","葔","葫","葟","葷","萿","蓃","葪","蔇","葭","葌","葏","葥","葁","蒋","葜","葝","萭","葅","葰","蒈","萪","蒅","蒉","葵","落","葻","萰","蒌","葎","萺","葿","葞","蒾","葂","募","萳","葩","蒎","葐","蓱","菐","葺","葴","萩","葋","葲","葚","葇","葠","萷","葉","葹","蒐","蓚","葖","萬","葦","葨","葳","蒍","葈","葸","萫","葙","葕","萱","萲","蒆","葯","葽","萾","蒏","萮","葾","蒀","葬","葤","蒃","葘","葼","葃","葄","蒊","蔜","蒡","蓓","蓖","蓽","蒲","蔀","蓡","蒼","蓛","蔯","蒭","蒓","蓌","蓞","蒧","蓧","蒽","蒶","蓋","蒿","蓕","蓘","蒚","蒦","蒺","蓟","蒹","蒟","蒯","蓝","蒗","蓢","蒞","蓠","蓮","蓤","蒥","蓅","蓏","蒙","蓩","蓂","蓦","墓","幕","蒳","蒘","蒰","蓜","蓬","蒪","蒱","蒨","蓁","蒛","蓉","蓐","蒻","蓑","蔱","蒒","蒔","蓍","蒴","蒜","蓀","蓎","蓨","蓪","蒤","蓊","蒠","蒵","蓆","蓒","蒣","蓄","蓔","蒑","蔭","蓥","蒮","蓣","蒝","蒬","蒕","蒷","蓙","蒖","蒸","蓫","蓗","蒩","蔼","蓭","蔽","蔈","蔔","蔡","蔵","蓸","蕏","蓴","蔟","蓯","蔥","蔖","蔋","蔐","蔕","蔸","蔉","蔮","蔊","蔛","蔰","蔧","蔒","蓻","蔪","蔣","蓵","蓳","蔞","蔨","薖","蔲","蔻","蓼","蔂","蔹","蔺","蔆","蕯","蓾","蔍","蔴","蔄","蔓","蔝","蔤","蔑","摹","慕","暮","蔫","蔦","蔢","蔳","蔷","蓲","蕖","蔘","蔏","蔎","蓿","蔌","蓷","蓶","蔚","蓰","薌","蔙","蔅","蓺","蔩","蔶","蔁","蔗","蔠","蕔","蕃","蕆","薘","蕩","蕇","薡","蕫","蕚","蕟","蕜","蕡","蕧","蕐","蕙","蕀","蕺","蕑","蕳","蔃","蕉","蕎","蕊","蕝","蕞","蕨","蕢","蕌","蔾","蕒","蕄","蕅","蕲","蕁","蕘","蕠","蕋","蕤","蕱","蕂","蔬","蕣","蕬","蕵","蕈","蕛","蔿","蕰","蕪","蕮","蕸","蕦","蕥","蕕","蓹","蕍","薁","蕓","蕴","薆","薜","薭","薄","薒","薋","薠","薣","薃","薅","薧","蕻","薨","薈","薉","薊","薦","薑","薢","薟","蕾","薐","薕","蕶","蕗","薍","薎","蕽","薔","薩","薓","薥","薯","蕼","薮","薞","薚","薙","薇","薳","蕹","薂","蕭","薛","薤","薪","藇","蕿","薫","薬","薏","蕷","薗","薀","薝","薽","藊","藏","薼","薵","薺","藂","藋","藡","薱","薾","藅","藁","藃","藱","藉","藆","藎","藈","藍","薶","藌","藐","薴","薿","薸","薲","藄","藒","藑","薷","藗","薹","藬","藓","薰","藀","薻","藵","藣","藨","藸","藪","藩","藳","藧","藠","藞","藟","藜","藔","藰","藘","藥","藦","藕","藲","藭","藷","藫","藤","藯","藖","藛","藚","藙","藝","藴","藢","藹","藽","蘁","藿","蘅","蘄","蘎","蘏","蘔","藾","藶","藺","蘆","蘉","蘑","孽","蘕","蘋","藮","蘒","蘧","蘂","蘃","蘇","蘓","蘣","蘈","蘀","蘊","蘐","藼","蘍","蘟","藻","蘖","蘗","蘯","蘩","蘤","蘳","蘮","蘜","蘰","蘫","蘭","蘝","蘞","蘦","蘢","蘪","蘠","蘘","蘶","蘚","蘨","蘙","蘡","蘌","蘛","蘥","蘴","蘬","蘷","蘲","蘺","蘵","蘹","蘾","蘻","虀","蘱","蘽","蘿","蘼","蘸","虃","虇","虄","虅","虁","虆","虂","虈","虉","虌","虊","虋"];
  let grown = 400;
  let interval;
  const container = document.getElementById("container");

  function growGrass() {
    if (grown <= 0) return clearInterval(interval);
    const elem = document.createElement("p");
    elem.innerHTML = chars[getRandomInt(0,chars.length)];
    elem.style.top = getRandomInt(150, window.innerHeight-150)+"px";
    elem.style.left = getRandomInt(150, window.innerWidth-150)+"px";
    container.appendChild(elem);
    grown--;
  }
  growGrass();
  interval = setInterval(growGrass, 25);
});